---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotSetFamilyTypeToNone
source: html/e05c01b7-d4c6-c8e2-3ce3-bce07d276c93.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotSetFamilyTypeToNone Property

Cannot set Family Type to 'None';.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSetFamilyTypeToNone { get; }
```